fbiego/dt78-esp32-firmware/src/main.cpp
#include "main.h"

#include <lvgl.h>

#include <Arduino_GFX_Library.h>
#include <ESP32Time.h>
// #include <CST816S.h>
#include "touch.h"
#include "bluetooth.h"
#include "kxtj3-1057.h"
#include "driver/rtc_io.h"

Arduino_DataBus *bus = new Arduino_ESP32SPI(21 /* DC */, 22 /* CS */, 18 /* SCK */, 23 /* MOSI */, -1 /* MISO */, VSPI /* spi_num */);
Arduino_GC9A01 *gfx = new Arduino_GC9A01(bus, 19, 0 /* rotation */, true /* IPS */);

ESP32Time rtc;
// CST816S touch(2, 4, 15, 14); // sda, scl, rst, irq
KXTJ3 myIMU(0x0F); // Address can be 0x0E or 0x0F

/* Change to your screen resolution */
static uint32_t screenWidth;
static uint32_t screenHeight;
static lv_disp_draw_buf_t draw_buf;
static lv_color_t *disp_draw_buf;
static lv_disp_drv_t disp_drv;

lv_obj_t *ui_textScreen;
lv_obj_t *ui_textScroll;
lv_obj_t *ui_textIcon;
lv_obj_t *ui_textTitle;
lv_obj_t *ui_textMessage;
lv_obj_t *ui_textTime;

lv_obj_t *ui_watchScreen;
lv_obj_t *ui_backgroundImage;
lv_obj_t *ui_stepsProgress;
lv_obj_t *ui_weekdayText;
lv_obj_t *ui_dateText;
lv_obj_t *ui_hourIcon1;
lv_obj_t *ui_hourIcon2;
lv_obj_t *ui_minuteIcon1;
lv_obj_t *ui_minuteIcon2;
lv_obj_t *ui_timeSeparator;
lv_obj_t *ui_textAmPm;
lv_obj_t *ui_stepsIcon;
lv_obj_t *ui_stepsText;
lv_obj_t *ui_bluetoothIcon;
lv_obj_t *ui_chargingIcon;

lv_obj_t *ui_settingsScreen;
lv_obj_t *ui_scrollSettings;
lv_obj_t *ui_bluetoothText;
lv_obj_t *ui_bluetoothSwitch;
lv_obj_t *ui_brightnessText;
lv_obj_t *ui_brightnessSlider;
lv_obj_t *ui_buttonvibrate;
lv_obj_t *ui_vibrateText;
lv_obj_t *ui_accelerometerText;
lv_obj_t *ui_accXtext;
lv_obj_t *ui_accXBar;
lv_obj_t *ui_accYText;
lv_obj_t *ui_accYBar;
lv_obj_t *ui_accZText;
lv_obj_t *ui_accZBar;
lv_obj_t *ui_themeText;
lv_obj_t *ui_colorWheel;

lv_obj_t *ui_menuScreen;
lv_obj_t *ui_menuList;
lv_obj_t *ui_buttonMessages;
lv_obj_t *ui_buttonHealth;
lv_obj_t *ui_buttonSettings;
lv_obj_t *ui_buttonStopwatch;
lv_obj_t *ui_buttonTimer;
lv_obj_t *ui_buttonAbout;
lv_obj_t *ui_buttonFitness;
lv_obj_t *ui_buttonHlt;
lv_obj_t *ui_buttonWeather;
lv_obj_t *ui_buttonFind;
lv_obj_t *ui_buttonMusic;

lv_obj_t *ui_messageListScreen;
lv_obj_t *ui_messageList;

LV_IMG_DECLARE(ui_img_zero_64_png);  // assets\zero_64.png
LV_IMG_DECLARE(ui_img_one_64_png);   // assets\one_64.png
LV_IMG_DECLARE(ui_img_two_64_png);   // assets\two_64.png
LV_IMG_DECLARE(ui_img_three_64_png); // assets\three_64.png
LV_IMG_DECLARE(ui_img_four_64_png);  // assets\four_64.png
LV_IMG_DECLARE(ui_img_five_64_png);  // assets\five_64.png
LV_IMG_DECLARE(ui_img_six_64_png);   // assets\six_64.png
LV_IMG_DECLARE(ui_img_seven_64_png); // assets\seven_64.png
LV_IMG_DECLARE(ui_img_eight_64_png); // assets\eight_64.png
LV_IMG_DECLARE(ui_img_nine_64_png);  // assets\nine_64.png

lv_img_dsc_t digits[10] = {ui_img_zero_64_png, ui_img_one_64_png, ui_img_two_64_png, ui_img_three_64_png, ui_img_four_64_png,
                           ui_img_five_64_png, ui_img_six_64_png, ui_img_seven_64_png, ui_img_eight_64_png, ui_img_nine_64_png};

bool bgImg = true;
LV_IMG_DECLARE(ui_img_background1_png); // assets\background1.png
LV_IMG_DECLARE(ui_img_background2_png); // assets\background2png
LV_IMG_DECLARE(ui_img_steps_png);       // assets\steps.png
LV_IMG_DECLARE(ui_img_vibrate_png);     // assets\vibrate.png
LV_IMG_DECLARE(ui_img_comment_png);     // assets\comment.png

LV_IMG_DECLARE(ui_img_bluetooth_png); // assets\bluetooth.png
LV_IMG_DECLARE(ui_img_energy_png);    // assets\energy.png

LV_IMG_DECLARE(ui_img_steps_png);     // assets\steps.png
LV_IMG_DECLARE(ui_img_about_png);     // assets\about.png
LV_IMG_DECLARE(ui_img_fitness_png);   // assets\fitness.png
LV_IMG_DECLARE(ui_img_message_png);   // assets\message.png
LV_IMG_DECLARE(ui_img_heart_png);     // assets\heart.png
LV_IMG_DECLARE(ui_img_weather_png);   // assets\weather.png
LV_IMG_DECLARE(ui_img_music_png);     // assets\music.png
LV_IMG_DECLARE(ui_img_timer_png);     // assets\timer.png
LV_IMG_DECLARE(ui_img_stopwatch_png); // assets\stopwatch.png
LV_IMG_DECLARE(ui_img_setting_png);   // assets\setting.png
LV_IMG_DECLARE(ui_img_search_png);    // assets\search.png

LV_IMG_DECLARE(ui_img_check_png); // assets\check.png

void ui_init(void);
void set_style(lv_obj_t *button);

/* Display flushing */
void my_disp_flush(lv_disp_drv_t *disp, const lv_area_t *area, lv_color_t *color_p)
{
  uint32_t w = (area->x2 - area->x1 + 1);
  uint32_t h = (area->y2 - area->y1 + 1);
  gfx->draw16bitBeRGBBitmap(area->x1, area->y1, (uint16_t *)&color_p->full, w, h);
  lv_disp_flush_ready(disp);
}

void set_time(uint8_t sc, uint8_t mn, uint8_t hr, uint8_t dy, uint8_t mt, int yr)
{
  rtc.setTime(sc, mn, hr, dy, mt, yr);
}

void checkButton1()
{
  button1State = digitalRead(BT1); // read the button state on the pin "BUTTON_PIN"
  if (button1State)
  {
    startPress1 = millis();
    //    Serial.print("HIGH - ");
    // button was pressed, currently high
  }
  else
  {
    long dur = millis() - startPress1;

    Serial.print("BTN1: ");
    Serial.println(dur);

    if (dur > DEBOUNCE)
    {
      if (screenOn)
      {
        lv_disp_t *display = lv_disp_get_default();
        lv_obj_t *actScr = lv_disp_get_scr_act(display);
        if (actScr != ui_menuScreen)
        {
          load_screen(1);
        }
        else
        {
          load_screen(0);
        }
      }
      else
      {
        screenOn = true;
        onTime = millis();
      }
    }
  }
}

void checkButton2()
{

  button2State = digitalRead(BT2); // read the button state on the pin "BUTTON_PIN"
  if (button2State)
  {
    startPress2 = millis();
    //    Serial.print("HIGH - ");
    // button was pressed, currently high
  }
  else
  {
    long dur = millis() - startPress2;

    Serial.print("BTN2: ");
    Serial.println(dur);

    if (dur > DEBOUNCE)
    {
      if (screenOn)
      {
        lv_disp_t *display = lv_disp_get_default();
        lv_obj_t *actScr = lv_disp_get_scr_act(display);
        if (actScr == ui_watchScreen)
        {
          screenOn = false;
        }
        else
        {
          load_screen(0);
        }
      }
      else
      {
        screenOn = true;
        onTime = millis();
      }
    }
  }
}

