fbiego/dt78-esp32-firmware/src/main.cpp
void theme_change(lv_event_t *e)
{
  lv_obj_t *picker = lv_event_get_target(e);
  // val = lv_slider_get_value(picker); //
  lv_color_t c = lv_colorwheel_get_rgb(picker);
  lv_disp_t *display = lv_disp_get_default();
  lv_theme_t *theme = lv_theme_default_init(display, c, lv_palette_main(LV_PALETTE_RED),
                                            true, LV_FONT_DEFAULT);
  lv_disp_set_theme(display, theme);
  lv_obj_set_style_img_recolor(ui_hourIcon1, c, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_img_recolor(ui_hourIcon2, c, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_img_recolor(ui_minuteIcon1, c, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_img_recolor(ui_minuteIcon2, c, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_text_color(ui_timeSeparator, c, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_text_color(ui_dateText, c, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_bg_color(ui_stepsProgress, c, LV_PART_INDICATOR | LV_STATE_DEFAULT);
}

static void event_handler(lv_event_t *e)
{
  lv_event_code_t code = lv_event_get_code(e);
  lv_obj_t *obj = lv_event_get_target(e);
  lv_obj_t *parent = lv_obj_get_parent(obj);

  if (code == LV_EVENT_CLICKED)
  {
    // LV_LOG_USER("Clicked: %s", lv_list_get_button_text(list1, obj));

    // String button = lv_list_get_button_text(list1, obj);
    // Serial.println(button);
    if (parent == ui_messageList)
    {
      uint32_t i;
      for (i = 0; i < lv_obj_get_child_cnt(parent); i++)
      {
        lv_obj_t *child = lv_obj_get_child(parent, i);
        lv_state_t st = lv_obj_get_state(child);
        if (st == LV_STATE_FOCUSED)
        {
          sMsg = cMsg - i;
          break;
        }
      }

      load_screen(3);
    }
    else
    {

      if (obj == ui_buttonSettings)
      {
        load_screen(2);
      }
      if (obj == ui_buttonMessages)
      {
        load_screen(4);
      }
      if (obj == ui_buttonAbout)
      {
        deep_sleep();
      }
    }
  }
}

static void slider_event_cb(lv_event_t *e)
{
  lv_obj_t *slider = lv_event_get_target(e);
  if (slider == ui_brightnessSlider)
  {
    brightness = (int)lv_slider_get_value(slider);
  }
}

static void button_event_handler(lv_event_t *e)
{
  lv_event_code_t code = lv_event_get_code(e);

  if (code == LV_EVENT_PRESSED)
  {
    motor = true;
  }
  else if (code == LV_EVENT_RELEASED)
  {
    motor = false;
  }
}

void bleButton(lv_event_t *e)
{
  lv_event_code_t code = lv_event_get_code(e);
  if (code == LV_EVENT_VALUE_CHANGED)
  {
    bool state = lv_obj_has_state(ui_bluetoothSwitch, LV_STATE_CHECKED);
    if (state)
    {
      BLEDevice::startAdvertising();
    }
    else
    {
      BLEDevice::stopAdvertising();
    }
  }
}

void my_gesture(lv_event_t *e)
{
  lv_obj_t *screen = lv_event_get_current_target(e);
  lv_dir_t dir = lv_indev_get_gesture_dir(lv_indev_get_act());
  switch (dir)
  {
  case LV_DIR_LEFT:
    if (screen == ui_watchScreen)
    {
      load_screen(2);
    }
    if (screen == ui_textScreen)
    {
      load_screen(0);
    }

    break;
  case LV_DIR_RIGHT:
    if (screen == ui_watchScreen)
    {
      load_screen(3);
      sMsg = cMsg;
    }
    else if (screen == ui_textScreen)
    {
      load_screen(4);
    }
    else if (screen == ui_menuScreen)
    {
      load_screen(0);
    }
    else
    {
      load_screen(1);
    }

    break;
  case LV_DIR_TOP:
    if (screen == ui_watchScreen)
    {
      load_screen(1);
    }

    break;
  case LV_DIR_BOTTOM:
    bgImg = !bgImg;
    if (bgImg)
    {
      lv_img_set_src(ui_backgroundImage, &ui_img_background1_png);
    }
    else
    {
      lv_img_set_src(ui_backgroundImage, &ui_img_background2_png);
    }

    break;
  }
}

void my_input_read(lv_indev_drv_t *drv, lv_indev_data_t *data)
{
  data->point.x = touch_data.xpos;
  data->point.y = touch_data.ypos;

  if (touch_data.touchpoints == 1 && touch_data.event == 2)
  {
    if (screenOn)
    {
      data->state = LV_INDEV_STATE_PR;
      // screenOn = true;
      onTime = millis();
      // Serial.println(touch_data.gesture);
    }
    else
    {
      data->state = LV_INDEV_STATE_REL;
    }
  }
  else
  {
    data->state = LV_INDEV_STATE_REL;
  }
  // return false; /*No buffering now so no more data read*/
}

static void scroll_event_cb(lv_event_t *e)
{
  lv_obj_t *ui_menuList = lv_event_get_target(e);

  lv_area_t ui_menuList_a;
  lv_obj_get_coords(ui_menuList, &ui_menuList_a);
  lv_coord_t ui_menuList_y_center = ui_menuList_a.y1 + lv_area_get_height(&ui_menuList_a) / 2;

  lv_coord_t r = lv_obj_get_height(ui_menuList) * 7 / 10;
  uint32_t i;
  uint32_t child_cnt = lv_obj_get_child_cnt(ui_menuList);
  for (i = 0; i < child_cnt; i++)
  {
    lv_obj_t *child = lv_obj_get_child(ui_menuList, i);
    lv_area_t child_a;
    lv_obj_get_coords(child, &child_a);

    lv_coord_t child_y_center = child_a.y1 + lv_area_get_height(&child_a) / 2;

    lv_coord_t diff_y = child_y_center - ui_menuList_y_center;
    diff_y = LV_ABS(diff_y);

    /*Get the x of diff_y on a circle.*/
    lv_coord_t x;
    /*If diff_y is out of the circle use the last point of the circle (the radius)*/
    if (diff_y >= r)
    {
      x = r;
    }
    else
    {
      /*Use Pythagoras theorem to get x from radius and y*/
      uint32_t x_sqr = r * r - diff_y * diff_y;
      lv_sqrt_res_t res;
      lv_sqrt(x_sqr, &res, 0x8000); /*Use lvgl's built in sqrt root function*/
      x = r - res.i;
    }

    /*Translate the item by the calculated X coordinate*/
    lv_obj_set_style_translate_x(child, x, 0);

    /*Use some opacity with larger translations*/
    // lv_opa_t opa = lv_map(x, 0, r, LV_OPA_TRANSP, LV_OPA_COVER);
    // lv_obj_set_style_opa(child, LV_OPA_COVER - opa, 0);
  }
}

void IRAM_ATTR screenInt()
{
  screenOn = true;
  onTime = millis();
}

void wakeup_reason()
{
  esp_sleep_wakeup_cause_t wakeup_reason;

  wakeup_reason = esp_sleep_get_wakeup_cause();

  switch (wakeup_reason)
  {
  case ESP_SLEEP_WAKEUP_EXT0:
    Serial.println("Wakeup caused by external signal using RTC_IO");
    break;
  case ESP_SLEEP_WAKEUP_EXT1:
    Serial.println("Wakeup caused by external signal using RTC_CNTL");
    break;
  case ESP_SLEEP_WAKEUP_TIMER:
    Serial.println("Wakeup caused by timer");
    break;
  case ESP_SLEEP_WAKEUP_TOUCHPAD:
    Serial.println("Wakeup caused by touchpad");
    break;
  case ESP_SLEEP_WAKEUP_ULP:
    Serial.println("Wakeup caused by ULP program");
    break;
  default:
    Serial.printf("Wakeup was not caused by deep sleep: %d\n", wakeup_reason);
    if (rtc.getYear() < 2000)
    {
      rtc.setTime(1655998793); // set the time if not coming from deep sleep ie reset or power up
    }
    break;
  }
}

void deep_sleep()
{

  digitalWrite(MOTOR, HIGH);
  delay(100);
  digitalWrite(MOTOR, LOW);
  ledcWrite(ledChannel, 0);
  sleep_touch(true);
  myIMU.standby(true);
  rtc_gpio_pullup_en(GPIO_NUM_32);

  esp_sleep_enable_ext0_wakeup(GPIO_NUM_32, 0); // 1 = High, 0 = Low

  // If you were to use ext1, you would use it like
  // esp_sleep_enable_ext1_wakeup(BUTTON_PIN_BITMASK,ESP_EXT1_WAKEUP_ANY_HIGH);

