fbiego/dt78-esp32-firmware/src/main.cpp
  // Go to sleep now
  Serial.println("Going to sleep now");
  esp_deep_sleep_start();
}

void setup()
{
  // put your setup code here, to run once:

  Serial.begin(115200);

  wakeup_reason();

  gfx->begin();
  gfx->fillScreen(BLACK);

  init_i2c();
  init_touch();
  pinMode(TINT, INPUT);
  // attachInterrupt(TINT, screenInt, RISING);

  lv_init();

  screenWidth = gfx->width();
  screenHeight = gfx->height();

  Serial.print("Width: ");
  Serial.print(screenWidth);
  Serial.print("\tHeight: ");
  Serial.println(screenHeight);
  disp_draw_buf = (lv_color_t *)malloc(sizeof(lv_color_t) * screenWidth * 10);
  if (!disp_draw_buf)
  {
    Serial.println("LVGL disp_draw_buf allocate failed!");
  }
  else
  {
    lv_disp_draw_buf_init(&draw_buf, disp_draw_buf, NULL, screenWidth * 10);

    /* Initialize the display */
    lv_disp_drv_init(&disp_drv);
    /* Change the following line to your display resolution */
    disp_drv.hor_res = screenWidth;
    disp_drv.ver_res = screenHeight;
    disp_drv.flush_cb = my_disp_flush;
    disp_drv.draw_buf = &draw_buf;
    lv_disp_drv_register(&disp_drv);

    /* Initialize the input device driver */
    static lv_indev_drv_t indev_drv;
    lv_indev_drv_init(&indev_drv);
    indev_drv.type = LV_INDEV_TYPE_POINTER;
    indev_drv.read_cb = my_input_read;
    lv_indev_drv_register(&indev_drv);

    lv_disp_t *display = lv_disp_get_default();
    lv_theme_t *theme = lv_theme_default_init(display, lv_palette_main(LV_PALETTE_BLUE), lv_palette_main(LV_PALETTE_RED),
                                              true, LV_FONT_DEFAULT);
    lv_disp_set_theme(display, theme);
    ui_watchScreen_screen_init();
    ui_menuScreen_screen_init();
    ui_messageListScreen_screen_init();
    ui_settingsScreen_screen_init();
    ui_textScreen_screen_init();
    lv_disp_load_scr(ui_watchScreen);

    Serial.println("Setup done");
  }

  if (myIMU.begin(sampleRate, accelRange) != 0)
  {
    Serial.print("Failed to initialize IMU.\n");
  }
  else
  {
    Serial.print("IMU initialized.\n");
  }

  myIMU.intConf(123, 1, 10, HIGH);

  onTime = millis();
  // pinMode(BL, OUTPUT);
  // digitalWrite(BL, HIGH);
  pinMode(CHARGE, INPUT);
  pinMode(BATT, INPUT);
  pinMode(MOTOR, OUTPUT);
  digitalWrite(MOTOR, HIGH);
  delay(100);
  digitalWrite(MOTOR, LOW);
  pinMode(B0, INPUT_PULLUP);
  attachInterrupt(B0, screenInt, FALLING);

  pinMode(BT1, INPUT_PULLUP);
  attachInterrupt(BT1, checkButton1, CHANGE);
  pinMode(BT2, INPUT_PULLUP);
  attachInterrupt(BT2, checkButton2, CHANGE);

  ledcSetup(ledChannel, freq, resolution);
  // attach the channel to the GPIO to be ui_menuListrolled
  ledcAttachPin(ledPin, ledChannel);
  ledcWrite(ledChannel, 100);

  init_BLE();
}

void loop()
{
  // put your main code here, to run repeatedly:

  if (screenOn)
  {
    get_read_touch();
  }

  lv_timer_handler(); /* let the GUI do its work */
  delay(5);

  String tm = rtc.getTime("%H:%M");
  int hr = rtc.getHour(hr24);
  int mn = rtc.getMinute();

  get_IMU();
  vector = sqrt((accX * accX) + (accY * accY) + (accZ * accZ));

  samples[x] = vector;
  x++;
  if (x >= SAMPLES)
  {
    x = 0;
    int st = calculate_steps();
    // lv_label_set_text(ui_Label9, String(st).c_str());
    curSteps += st;
  }
  lv_disp_t *display = lv_disp_get_default();
  lv_obj_t *actScr = lv_disp_get_scr_act(display);

  if (actScr == ui_watchScreen)
  {
    lv_label_set_text(ui_dateText, rtc.getTime("%d %B").c_str());
    lv_label_set_text(ui_weekdayText, rtc.getTime("%A").c_str());
    lv_label_set_text(ui_textAmPm, rtc.getAmPm(false).c_str());

    lv_img_set_src(ui_hourIcon1, &digits[hr / 10]);
    lv_img_set_src(ui_hourIcon2, &digits[hr % 10]);
    lv_img_set_src(ui_minuteIcon1, &digits[mn / 10]);
    lv_img_set_src(ui_minuteIcon2, &digits[mn % 10]);

    lv_label_set_text(ui_stepsText, String(curSteps).c_str());

    stepsProgress = (curSteps / 5000) * 100;

    lv_arc_set_value(ui_stepsProgress, curSteps);

    if (hr24)
    {
      lv_obj_add_flag(ui_textAmPm, LV_OBJ_FLAG_HIDDEN | LV_OBJ_FLAG_ADV_HITTEST);
    }
    else
    {
      lv_obj_clear_flag(ui_textAmPm, LV_OBJ_FLAG_HIDDEN);
    }

    if (digitalRead(CHARGE))
    {
      lv_obj_add_flag(ui_chargingIcon, LV_OBJ_FLAG_HIDDEN | LV_OBJ_FLAG_ADV_HITTEST);
    }
    else
    {
      lv_obj_clear_flag(ui_chargingIcon, LV_OBJ_FLAG_HIDDEN);
    }
    if (!deviceConnected)
    {
      lv_obj_add_flag(ui_bluetoothIcon, LV_OBJ_FLAG_HIDDEN | LV_OBJ_FLAG_ADV_HITTEST);
    }
    else
    {
      lv_obj_clear_flag(ui_bluetoothIcon, LV_OBJ_FLAG_HIDDEN);
    }
  }
  else if (actScr == ui_settingsScreen)
  {
    digitalWrite(MOTOR, motor);

    lv_bar_set_value(ui_accXBar, map((accX * 100), -100, 100, 0, 100), LV_ANIM_ON);
    lv_bar_set_value(ui_accYBar, map((accY * 100), -100, 100, 0, 100), LV_ANIM_ON);
    lv_bar_set_value(ui_accZBar, map((accZ * 100), -100, 100, 0, 100), LV_ANIM_ON);
  }

  if (isNotify)
  {
    isNotify = false;
    digitalWrite(MOTOR, HIGH);
    delay(notifyTime);
    digitalWrite(MOTOR, LOW);
  }

  if (accX > 0.3 && accX < 1.0 && accY > -0.3 && accY < 0.3 && accZ > -1.0 && accZ < -0.7)
  {
    screenOn = true;
  }

  if (screenOn)
  {
    // digitalWrite(BL, HIGH);
    ledcWrite(ledChannel, brightness + 1);
    String chrg = digitalRead(CHARGE) ? "" : "Charging";
    // String per = String(getBattery()) + "mV";
    if ((onTime + 10000) < millis())
    {
      screenOn = false;
    }
  }
  else
  {
    ledcWrite(ledChannel, 0);
    load_screen(0); // back to watchScreen
  }
}

void load_screen(int screen)
{
  switch (screen)
  {
  case 0:
    lv_disp_load_scr(ui_watchScreen);
    break;
  case 1:
    lv_disp_load_scr(ui_menuScreen);
    break;
  case 2:
    lv_disp_load_scr(ui_settingsScreen);
    break;
  case 3:
    lv_disp_load_scr(ui_textScreen);
    break;
  case 4:
    reload_message_list();
    lv_disp_load_scr(ui_messageListScreen);
    break;
  }
}

void reload_message_list()
{
  lv_obj_clean(ui_messageList);

  if (cMsg < 0)
  {
    lv_obj_t *msgSelect = lv_list_add_btn(ui_messageList, &ui_img_message_png, "No messages");
    set_style(msgSelect);
  }

