fbiego/dt78-esp32-firmware/src/main.cpp
  lv_obj_set_width(ui_brightnessSlider, 150);
  lv_obj_set_height(ui_brightnessSlider, 10);

  lv_obj_set_x(ui_brightnessSlider, 0);
  lv_obj_set_y(ui_brightnessSlider, -30);

  lv_obj_set_align(ui_brightnessSlider, LV_ALIGN_CENTER);

  lv_obj_clear_flag(ui_brightnessSlider, LV_OBJ_FLAG_GESTURE_BUBBLE);

  lv_obj_add_event_cb(ui_brightnessSlider, slider_event_cb, LV_EVENT_VALUE_CHANGED, NULL);

  // ui_buttonvibrate

  ui_buttonvibrate = lv_imgbtn_create(ui_scrollSettings);
  lv_imgbtn_set_src(ui_buttonvibrate, LV_IMGBTN_STATE_RELEASED, NULL, &ui_img_vibrate_png, NULL);
  lv_imgbtn_set_src(ui_buttonvibrate, LV_IMGBTN_STATE_PRESSED, NULL, &ui_img_vibrate_png, NULL);

  lv_obj_set_height(ui_buttonvibrate, 24);
  lv_obj_set_width(ui_buttonvibrate, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_buttonvibrate, -51);
  lv_obj_set_y(ui_buttonvibrate, 5);

  lv_obj_set_align(ui_buttonvibrate, LV_ALIGN_CENTER);

  lv_obj_set_style_outline_color(ui_buttonvibrate, lv_color_hex(0xFFFFFF), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_outline_opa(ui_buttonvibrate, 255, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_outline_width(ui_buttonvibrate, 1, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_outline_pad(ui_buttonvibrate, 5, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_border_color(ui_buttonvibrate, lv_color_hex(0x22540C), LV_PART_MAIN | LV_STATE_PRESSED);
  lv_obj_set_style_border_opa(ui_buttonvibrate, 255, LV_PART_MAIN | LV_STATE_PRESSED);
  lv_obj_set_style_border_width(ui_buttonvibrate, 2, LV_PART_MAIN | LV_STATE_PRESSED);
  lv_obj_set_style_img_recolor(ui_buttonvibrate, lv_color_hex(0x2B258D),
                               LV_PART_MAIN | LV_STATE_CHECKED | LV_STATE_PRESSED);
  lv_obj_set_style_img_recolor_opa(ui_buttonvibrate, 255, LV_PART_MAIN | LV_STATE_CHECKED | LV_STATE_PRESSED);

  lv_obj_add_event_cb(ui_buttonvibrate, button_event_handler, LV_EVENT_ALL, NULL);

  // ui_vibrateText

  ui_vibrateText = lv_label_create(ui_scrollSettings);

  lv_obj_set_width(ui_vibrateText, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_vibrateText, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_vibrateText, 25);
  lv_obj_set_y(ui_vibrateText, 5);

  lv_obj_set_align(ui_vibrateText, LV_ALIGN_CENTER);

  lv_label_set_text(ui_vibrateText, "Vibrate Test");

  // ui_accelerometerText

  ui_accelerometerText = lv_label_create(ui_scrollSettings);

  lv_obj_set_width(ui_accelerometerText, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_accelerometerText, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_accelerometerText, 0);
  lv_obj_set_y(ui_accelerometerText, 62);

  lv_obj_set_align(ui_accelerometerText, LV_ALIGN_CENTER);

  lv_label_set_text(ui_accelerometerText, "Accelerometer");

  // ui_accXtext

  ui_accXtext = lv_label_create(ui_scrollSettings);

  lv_obj_set_width(ui_accXtext, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_accXtext, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_accXtext, -75);
  lv_obj_set_y(ui_accXtext, 80);

  lv_obj_set_align(ui_accXtext, LV_ALIGN_CENTER);

  lv_label_set_text(ui_accXtext, "X");

  // ui_accXBar

  ui_accXBar = lv_bar_create(ui_scrollSettings);
  lv_bar_set_range(ui_accXBar, 0, 100);
  lv_bar_set_value(ui_accXBar, 25, LV_ANIM_OFF);

  lv_obj_set_width(ui_accXBar, 150);
  lv_obj_set_height(ui_accXBar, 10);

  lv_obj_set_x(ui_accXBar, 10);
  lv_obj_set_y(ui_accXBar, 80);

  lv_obj_set_align(ui_accXBar, LV_ALIGN_CENTER);

  // ui_accYText

  ui_accYText = lv_label_create(ui_scrollSettings);

  lv_obj_set_width(ui_accYText, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_accYText, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_accYText, -75);
  lv_obj_set_y(ui_accYText, 100);

  lv_obj_set_align(ui_accYText, LV_ALIGN_CENTER);

  lv_label_set_text(ui_accYText, "Y");

  // ui_accYBar

  ui_accYBar = lv_bar_create(ui_scrollSettings);
  lv_bar_set_range(ui_accYBar, 0, 100);
  lv_bar_set_value(ui_accYBar, 25, LV_ANIM_OFF);

  lv_obj_set_width(ui_accYBar, 150);
  lv_obj_set_height(ui_accYBar, 10);

  lv_obj_set_x(ui_accYBar, 10);
  lv_obj_set_y(ui_accYBar, 100);

  lv_obj_set_align(ui_accYBar, LV_ALIGN_CENTER);

  // ui_accZText

  ui_accZText = lv_label_create(ui_scrollSettings);

  lv_obj_set_width(ui_accZText, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_accZText, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_accZText, -75);
  lv_obj_set_y(ui_accZText, 120);

  lv_obj_set_align(ui_accZText, LV_ALIGN_CENTER);

  lv_label_set_text(ui_accZText, "Z");

  // ui_accZBar

  ui_accZBar = lv_bar_create(ui_scrollSettings);
  lv_bar_set_range(ui_accZBar, 0, 100);
  lv_bar_set_value(ui_accZBar, 25, LV_ANIM_OFF);

  lv_obj_set_width(ui_accZBar, 150);
  lv_obj_set_height(ui_accZBar, 10);

  lv_obj_set_x(ui_accZBar, 10);
  lv_obj_set_y(ui_accZBar, 120);

  lv_obj_set_align(ui_accZBar, LV_ALIGN_CENTER);

  // ui_themeText

  ui_themeText = lv_label_create(ui_scrollSettings);

  lv_obj_set_width(ui_themeText, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_themeText, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_themeText, 0);
  lv_obj_set_y(ui_themeText, 145);

  lv_obj_set_align(ui_themeText, LV_ALIGN_CENTER);

  lv_label_set_text(ui_themeText, "ThemeColor");

  // ui_colorWheel

  ui_colorWheel = lv_colorwheel_create(ui_scrollSettings, true);

  lv_obj_set_width(ui_colorWheel, 150);
  lv_obj_set_height(ui_colorWheel, 150);

  lv_obj_set_x(ui_colorWheel, 0);
  lv_obj_set_y(ui_colorWheel, 200);

  lv_obj_set_align(ui_colorWheel, LV_ALIGN_TOP_MID);

  lv_obj_add_event_cb(ui_colorWheel, theme_change, LV_EVENT_VALUE_CHANGED, NULL);
}

void ui_menuScreen_screen_init(void)
{

  // ui_menuScreen

  ui_menuScreen = lv_obj_create(NULL);

  lv_obj_set_style_bg_color(ui_menuScreen, lv_color_hex(0x000000), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_bg_opa(ui_menuScreen, 255, LV_PART_MAIN | LV_STATE_DEFAULT);

  lv_obj_add_event_cb(ui_menuScreen, my_gesture, LV_EVENT_GESTURE, NULL);

  ui_menuList = lv_obj_create(ui_menuScreen);
  lv_obj_set_size(ui_menuList, 240, 240);
  lv_obj_center(ui_menuList);
  lv_obj_set_flex_flow(ui_menuList, LV_FLEX_FLOW_COLUMN);
  lv_obj_add_event_cb(ui_menuList, scroll_event_cb, LV_EVENT_SCROLL, NULL);
  lv_obj_set_style_radius(ui_menuList, LV_RADIUS_CIRCLE, 0);
  lv_obj_set_style_clip_corner(ui_menuList, true, 0);
  lv_obj_set_scroll_dir(ui_menuList, LV_DIR_VER);
  // lv_obj_set_scroll_snap_y(ui_menuList, LV_SCROLL_SNAP_CENTER);
  lv_obj_set_scrollbar_mode(ui_menuList, LV_SCROLLBAR_MODE_OFF);
  lv_obj_set_style_bg_color(ui_menuList, lv_color_hex(0x000000), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_border_width(ui_menuList, 0, LV_PART_MAIN | LV_STATE_DEFAULT);

  lv_obj_set_style_pad_top(ui_menuList, 50, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_pad_bottom(ui_menuList, 50, LV_PART_MAIN | LV_STATE_DEFAULT);

  ui_buttonMessages = lv_list_add_btn(ui_menuList, &ui_img_message_png, "Messages");
  lv_obj_add_event_cb(ui_buttonMessages, event_handler, LV_EVENT_CLICKED, NULL);
  set_style(ui_buttonMessages);

  ui_buttonFitness = lv_list_add_btn(ui_menuList, &ui_img_fitness_png, "Fitness");
  lv_obj_add_event_cb(ui_buttonFitness, event_handler, LV_EVENT_CLICKED, NULL);
  set_style(ui_buttonFitness);

