fbiego/dt78-esp32-firmware/src/main.cpp
  ui_buttonHealth = lv_list_add_btn(ui_menuList, &ui_img_heart_png, "Health");
  lv_obj_add_event_cb(ui_buttonHealth, event_handler, LV_EVENT_CLICKED, NULL);
  set_style(ui_buttonHealth);

  ui_buttonWeather = lv_list_add_btn(ui_menuList, &ui_img_weather_png, "Weather");
  lv_obj_add_event_cb(ui_buttonWeather, event_handler, LV_EVENT_CLICKED, NULL);
  set_style(ui_buttonWeather);

  ui_buttonMusic = lv_list_add_btn(ui_menuList, &ui_img_music_png, "Music");
  lv_obj_add_event_cb(ui_buttonMusic, event_handler, LV_EVENT_CLICKED, NULL);
  set_style(ui_buttonMusic);

  ui_buttonStopwatch = lv_list_add_btn(ui_menuList, &ui_img_stopwatch_png, "Stopwatch");
  lv_obj_add_event_cb(ui_buttonStopwatch, event_handler, LV_EVENT_CLICKED, NULL);
  set_style(ui_buttonStopwatch);

  ui_buttonTimer = lv_list_add_btn(ui_menuList, &ui_img_timer_png, "Timer");
  lv_obj_add_event_cb(ui_buttonTimer, event_handler, LV_EVENT_CLICKED, NULL);
  set_style(ui_buttonTimer);

  ui_buttonFind = lv_list_add_btn(ui_menuList, &ui_img_search_png, "Find My Phone");
  lv_obj_add_event_cb(ui_buttonFind, event_handler, LV_EVENT_CLICKED, NULL);
  set_style(ui_buttonFind);

  ui_buttonSettings = lv_list_add_btn(ui_menuList, &ui_img_setting_png, "Settings");
  lv_obj_add_event_cb(ui_buttonSettings, event_handler, LV_EVENT_CLICKED, NULL);
  set_style(ui_buttonSettings);

  ui_buttonAbout = lv_list_add_btn(ui_menuList, &ui_img_about_png, "Sleep");
  lv_obj_add_event_cb(ui_buttonAbout, event_handler, LV_EVENT_CLICKED, NULL);
  set_style(ui_buttonAbout);

  /*Update the buttons position manually for first*/
  lv_event_send(ui_menuList, LV_EVENT_SCROLL, NULL);

  /*Be sure the fist button is in the middle*/
  lv_obj_scroll_to_view(lv_obj_get_child(ui_menuList, 0), LV_ANIM_ON);
}

void ui_messageListScreen_screen_init(void)
{

  // ui_messageListScreen

  ui_messageListScreen = lv_obj_create(NULL);

  lv_obj_set_style_bg_color(ui_messageListScreen, lv_color_hex(0x000000), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_bg_opa(ui_messageListScreen, 255, LV_PART_MAIN | LV_STATE_DEFAULT);

  lv_obj_add_event_cb(ui_messageListScreen, my_gesture, LV_EVENT_GESTURE, NULL);

  ui_messageList = lv_obj_create(ui_messageListScreen);
  lv_obj_set_size(ui_messageList, 240, 240);
  lv_obj_center(ui_messageList);
  lv_obj_set_flex_flow(ui_messageList, LV_FLEX_FLOW_COLUMN);
  lv_obj_add_event_cb(ui_messageList, scroll_event_cb, LV_EVENT_SCROLL, NULL);
  lv_obj_set_style_radius(ui_messageList, LV_RADIUS_CIRCLE, 0);
  lv_obj_set_style_clip_corner(ui_messageList, true, 0);
  lv_obj_set_scroll_dir(ui_messageList, LV_DIR_VER);
  lv_obj_set_scroll_snap_y(ui_messageList, LV_SCROLL_SNAP_CENTER);
  lv_obj_set_scrollbar_mode(ui_messageList, LV_SCROLLBAR_MODE_OFF);
  lv_obj_set_style_bg_color(ui_messageList, lv_color_hex(0x000000), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_border_width(ui_messageList, 0, LV_PART_MAIN | LV_STATE_DEFAULT);

  lv_obj_set_style_pad_top(ui_messageList, 50, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_pad_bottom(ui_messageList, 50, LV_PART_MAIN | LV_STATE_DEFAULT);
}
